# input = input("enter the word:")

def count_char(input):
    count = 0
    for i in input:
        count += 1
    return count
# print(count_char(input))
print(count_char('今天請到特有生物保育研究中心許再文研究員來跟我們介紹很多植物以及很多昆蟲，對我來說很新鮮，但這些昆蟲和植物都是高機率出現在我們身旁，只是我們不會去瞭借他們而已。從一開始許先生問我們有沒有看過稻穗的花，回想起來，我還真的沒有仔細看過稻穗的花，應該說，如果你要我回想稻穗的花長什麼樣子，我會完全沒有概念。今天介紹道菜的時候有一個我覺得很有趣的橋段，就是許先生問我們蔥、韭菜、蒜等等「常見」葷蔬菜的樣子和區別，但根本沒有人回覆他，或許是大家對主題沒興趣，但我覺得根本就是大家也不認識他們。他也說現在的大學生都沒在買菜了，通常都是去餐廳或者叫外賣，不要說分辨煮好的南洋山蘇花和山蘇花的差別了 (有無名線稜線)，我們就連他沒被主的樣子都不知道了，這也讓我好想試著自己買菜煮菜，因為太依賴餐廳或者外賣，雖然很方便，但老實說我連自己在吃啥都不知道，就講真實發生在我身上的事，我有時候去煦悅買便當要選菜，但我不認識他們，只能說像是「右邊那個黑色的」、「左邊那個白白的」諸如此類的話，現在想想也覺惡蠻可笑的。'))